"Service Update Failed" = "Actualizare serviciu eșuată";
"Service Update Complete" = "Actualizare serviciu completă";
"Starting Service Update" = "Pornire actualizare serviciu";
"Dismiss" = "Ignorați";
"OK" = "OK";
"Call disallowed" = "Acest număr nu este permis";
